In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [2]:
ser1 = Series(np.arange(8))

In [3]:
ser1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

In [4]:
ser1.replace(0,'#',inplace=True)

In [5]:
ser1

0    #
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: object

In [10]:
ser1.replace(['#',4],[15,17])

0    15
1     1
2     2
3     3
4    17
5     5
6     6
7     7
dtype: int64

In [11]:
ser1.replace({2:66})

0     #
1     1
2    66
3     3
4     4
5     5
6     6
7     7
dtype: object

In [12]:
ser1.replace(4, method = 'bfill')    #bfill -> geriye doğru doldur
                                  #ffil -> ileriye doğru doldur

0    #
1    1
2    2
3    3
4    5
5    5
6    6
7    7
dtype: object

In [14]:
df = pd.DataFrame(np.arange(1,16).reshape(5,3),
                 columns=['X','Y','Z'])

In [15]:
df

    X   Y   Z
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [16]:
df.replace([1,2,3],[55,55,55])

    X   Y   Z
0  55  55  55
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [17]:
df

    X   Y   Z
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [18]:
df.replace({'X':1, 'Y':2 },100)

     X    Y   Z
0  100  100   3
1    4    5   6
2    7    8   9
3   10   11  12
4   13   14  15

In [22]:
df.replace({'Z': {3:100, 6:100}})

    X   Y    Z
0   1   2  100
1   4   5  100
2   7   8    9
3  10  11   12
4  13  14   15